import math

# Вводимо значенння сторін першого прямокутника

print("Введите значение длины сторон первого прямоугольника")
a = float(input("a="))
if a <= 0:
    print ("Данные введены некорректно.")
    exit(0)
b = float(input("b="))
if b <= 0:
    print ("Данные введены некорректно.")
    exit(0)
 # Вводимо значенння сторін другого прямокутника
print("Введите значение длины сторон второго прямоугольника")
c = float(input("c="))
if c <= 0:
    print ("Данные введены некорректно.")
    exit(0)
d = float(input("d="))
if d <= 0:
    print ("Данные введены некорректно.")
    exit(0)
    # Знаходимо більшу та меншу сторони першого прямокутника

if a>=b:
    Max1 = a
    Min1 = b
    
else:
    Max1 = b
    Min1 = a
    
    # Знаходимо більшу та меншу сторони другого прямокутника
if c>=d:
    Max2 = c
    Min2 = d
    
else:
    Max2 = d
    Min2 = c
    

# Більші стороні порівнюємо між собою, те саме з меншими сторонами
if Max1 <= Max2 and Min1 <= Min2:
    print("Прямоугольник со сторонами a и b можно поместить в прямоуголник со сторонами c и d.")

if Max1 > Max2 or Min1 > Min2:
    print("Прямоугольник со сторонами a и b нельзя поместить в прямоуголник со сторонами c и d.")

   