import math
print("Введите значение погрешности (е), при условии что е>0")
eps = float(input("e = ")) # Вводимо е
if eps <= 0: # Порівнюємо e з нулем
        cout << "Данные введены некорректно." << endl;
        exit(0)

ykm1 = float(0) # y(0) 
yk = float(1./2) # y(1)

while (yk - ykm1) >= eps:
        
         ykm1 = yk; # Віддаємо значення yk ykm1
         yk = ((ykm1 + 1) / (ykm1 + 2)); # Знаходимо y(n+1) та выддаємо це значення yk

print("y(n) = ", yk) # Виводимо y(n), для якого виконується нерівність
print("y(n-1) = ", ykm1) # Виводимо y(n-1)
print("y(n) - y(n-1) = ", yk - ykm1) # Виводимо різницю y(n) та y(n-1)
print (yk - ykm1, " < ", eps) # Порінюємо різницю y(n) та y(n-1) з e
print("Ответ: ", yk) # Виводимо відповідь

